NN_Pred/OpenFOAM-Extension/tutorials/turbulent_channel/Cases/YamashinaClosedNN/0/nut_U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "33";
    object      nut_U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in
    {
        type            calculated;
        value           uniform 0;
    }
    out
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            nutUWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    si
    {
        type            symmetry;
    }
}


// ************************************************************************* //
